backend/app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    render json:Team.find(params[:id])

INSERT INTO "user_teams" ("user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["team_id", 16], ["created_at", "2019-03-05 22:58:52.502078"], ["updated_at", "2019-03-05 22:58:52.502078"]]
---
  def create
    render json:Team.create(team_params)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def update
      Team.find(params[:id]).update(team_params)
      render json: Team.find(params[:id])